import 'package:advocateoffice/model/task.dart';

List<TaskModel> taskList = [
  TaskModel(
    dateRange: "05 Dec 2024 to 10 Dec 2024",
    priority: "High",
    title: "قانون",
    description:
    "القانون هو نظام من القواعد التي تُنشئها وتُطبقها المؤسسات الحكومية أو الاجتماعية لتنظيم السلوك.",
    assignedTo: "سيدّيك",
    contact: "01737374083",
  ),
  TaskModel(
    dateRange: "15 Dec 2024 to 20 Dec 2024",
    priority: "Medium",
    title: "مراجعة عقد",
    description:
    "القانون هو نظام من القواعد التي تُنشئها وتُطبقها المؤسسات الحكومية أو الاجتماعية لتنظيم السلوك. يهدف إلى الحفاظ على النظام، وحل النزاعات، وحماية الحقوق، وتحقيق العدالة. قد تكون القوانين مكتوبة أو غير مكتوبة، وتختلف من دولة لأخرى أو من مجتمع لآخر. تشمل الأنظمة القانونية عادةً القانون الجنائي، والقانون المدني، والقانون الإداري، وغيرها. تقوم المحاكم والمتخصصون القانونيون بتفسير وتطبيق القانون لضمان تحقيق العدالة. وتتطور القوانين بمرور الوقت لمواكبة تغيّرات المجتمع وتحدّياته.",
    assignedTo: "جون دو",
    contact: "01712345678",
  ),
  TaskModel(
    dateRange: "05 Dec 2024 to 10 Dec 2024",
    priority: "High",
    title: "قانون",
    description:
    "القانون هو نظام من القواعد التي تُنشئها وتُطبقها المؤسسات الحكومية أو الاجتماعية لتنظيم السلوك.",
    assignedTo: "سيدّيك",
    contact: "01737374083",
  ),
  TaskModel(
    dateRange: "15 Dec 2024 to 20 Dec 2024",
    priority: "Medium",
    title: "مراجعة عقد",
    description:
    "القانون هو نظام من القواعد التي تُنشئها وتُطبقها المؤسسات الحكومية أو الاجتماعية لتنظيم السلوك. يهدف إلى الحفاظ على النظام، وحل النزاعات، وحماية الحقوق، وتحقيق العدالة. قد تكون القوانين مكتوبة أو غير مكتوبة، وتختلف من دولة لأخرى أو من مجتمع لآخر. تشمل الأنظمة القانونية عادةً القانون الجنائي، والقانون المدني، والقانون الإداري، وغيرها. تقوم المحاكم والمتخصصون القانونيون بتفسير وتطبيق القانون لضمان تحقيق العدالة. وتتطور القوانين بمرور الوقت لمواكبة تغيّرات المجتمع وتحدّياته.",
    assignedTo: "جون دو",
    contact: "01712345678",
  ),
];
